**Dealing with Missing values**

In [2]:
import numpy as np
import pandas as pd

In [4]:
df = pd.DataFrame({'A':[1,2,np.nan],
                  'B':[5,np.nan,np.nan],
                  'C':[1,2,3]})
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [6]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [8]:
df.dropna(axis = 1)

   C
0  1
1  2
2  3

In [12]:
df.dropna(thresh = 2) # takes rows with atleast 2 non null values

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [18]:
df.fillna(0)

     A    B  C
0  1.0  5.0  1
1  2.0  0.0  2
2  0.0  0.0  3

In [22]:
df.fillna(value = df['A'].mean())

     A    B  C
0  1.0  5.0  1
1  2.0  1.5  2
2  1.5  1.5  3